Jacobplo/epsdkx/hal/stm32f1/spi.c
#include <epsdkx/common/gpio.h>
#include <epsdkx/common/spi.h>
#include <epsdkx/hal/spi.h>

#include <epsdkx/hal/gpio.h>
#include <epsdkx/generated/config.h>
#include "private/nvic.h"
#include "private/rx_buffer.h"
#include "private/rcc.h"

#include <errno.h>
#include <stdint.h>
#include <stddef.h>

#include "stm32f1xx.h"


#ifndef CONFIG_GPIO
#error Must enable CONFIG_GPIO to use SPI
#endif

#define SPI_CHANNEL_IDX(n) ((n) - 1)
#define SPI_CHANNEL_COUNT  2

typedef struct hal_spi_config_s {
  spi_pins_s pins;
  SPI_TypeDef *reg;
  hal_nvic_line_device_e irq;
  hal_rx_buffer_s rx_buf;
} hal_spi_config_s;

static hal_spi_config_s spi_pin_map[SPI_CHANNEL_COUNT] = {
  [SPI_CHANNEL_IDX(SPI(1))] = (hal_spi_config_s){ 
    .pins = { 
      .nss  = PORT_PIN('A', 4),
      .sclk = PORT_PIN('A', 5),
      .miso = PORT_PIN('A', 6),
      .mosi = PORT_PIN('A', 7),
    },
    .reg = SPI1,
    .irq = NVIC_SPI1
  },
  [SPI_CHANNEL_IDX(SPI(2))] = (hal_spi_config_s){ 
    .pins = { 
      .nss  = PORT_PIN('B', 12),
      .sclk = PORT_PIN('B', 13),
      .miso = PORT_PIN('B', 14),
      .mosi = PORT_PIN('B', 15),
    },
    .reg = SPI2,
    .irq = NVIC_SPI2
  },
};

// Sets baud rate to a speed close to 1 to 2 MHz
static void hal_spi_set_baud_rate(spi_channel_t channel);

static inline void hal_spi_common_isr(spi_channel_t channel);


int hal_spi_init(spi_channel_t channel, spi_mode_e mode, spi_cpol_e cpol, spi_cpha_e cpha) {
  if (SPI_CHANNEL_IDX(channel) >= SPI_CHANNEL_COUNT) return -EINVAL;

  hal_spi_config_s *cfg = &spi_pin_map[SPI_CHANNEL_IDX(channel)]; 

  // Enable clock for SPI
  switch(channel) {
    case SPI(1):
      RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;    
      break;
    case SPI(2):
      RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
      break;
  }

  hal_gpio_init();

  // Set 8-bit data width
  cfg->reg->CR1 &= ~(SPI_CR1_DFF);

  // Set MSB first format
  cfg->reg->CR1 &= ~(SPI_CR1_LSBFIRST);

  switch (mode) {
    case SPI_MASTER:
      hal_gpio_configure(&cfg->pins.nss, GPIO_OUT);
      hal_gpio_configure(&cfg->pins.sclk, GPIO_OUT_ALT_PUSH_PULL);
      hal_gpio_configure(&cfg->pins.mosi, GPIO_OUT_ALT_PUSH_PULL);
      hal_gpio_configure(&cfg->pins.miso, GPIO_IN);

      hal_spi_set_baud_rate(channel); 

      // Set software slave select
      cfg->reg->CR1 |= (SPI_CR1_SSM | SPI_CR1_SSI);

      // Set master mode
      cfg->reg->CR1 |= SPI_CR1_MSTR;
      break;

    case SPI_SLAVE:
      hal_gpio_configure(&cfg->pins.nss, GPIO_IN);
      hal_gpio_configure(&cfg->pins.sclk, GPIO_IN);
      hal_gpio_configure(&cfg->pins.mosi, GPIO_IN);
      hal_gpio_configure(&cfg->pins.miso, GPIO_OUT_ALT_OPEN_DRAIN);

      // Set slave mode
      cfg->reg->CR1 &= ~(SPI_CR1_MSTR);
      break;
  }

  // Set clock polarity
  switch (cpol) {
    case SPI_CPOL0:
      cfg->reg->CR1 &= ~(SPI_CR1_CPOL);
      break;
    case SPI_CPOL1:
      cfg->reg->CR1 |= SPI_CR1_CPOL;
      break;
  }

  // Set clock phase
  switch (cpha) {
    case SPI_CPHA0:
      cfg->reg->CR1 &= ~(SPI_CR1_CPHA);
      break;
    case SPI_CPHA1:
      cfg->reg->CR1 |= SPI_CR1_CPHA;
      break;
  } 

  // Receiver interrupt enable
  hal_nvic_init_device(cfg->irq);
  cfg->reg->CR2 |= SPI_CR2_RXNEIE;

  // Set SPI enable
  cfg->reg->CR1 |= SPI_CR1_SPE;

  return 0;
}

const spi_pins_s *hal_spi_get_pins(spi_channel_t channel) {
  if (SPI_CHANNEL_IDX(channel) >= SPI_CHANNEL_COUNT) return NULL;

  return &spi_pin_map[SPI_CHANNEL_IDX(channel)].pins;
}

int hal_spi_read_write(spi_channel_t channel, uint8_t tx) {
  if (SPI_CHANNEL_IDX(channel) >= SPI_CHANNEL_COUNT) return -EINVAL;

  hal_spi_config_s *cfg = &spi_pin_map[SPI_CHANNEL_IDX(channel)];

  // Wait until data register is transferred to the transmission shift register.
  while (!(cfg->reg->SR & SPI_SR_TXE)) (void)0;

  // Write to data register
  cfg->reg->DR = tx;

  return 0;
}

int hal_spi_get(spi_channel_t channel, uint8_t *rx) {
  hal_spi_config_s *cfg = &spi_pin_map[SPI_CHANNEL_IDX(channel)];

  return hal_rx_buffer_get(&cfg->rx_buf, rx);
}

static void hal_spi_set_baud_rate(spi_channel_t channel) {
  hal_spi_config_s *cfg = &spi_pin_map[SPI_CHANNEL_IDX(channel)];

  cfg->reg->CR1 &= ~(SPI_CR1_BR);

  uint32_t pclk;
  switch (channel) {
    case SPI(1):
      pclk = hal_rcc_get_pclk2();
      break;
    case SPI(2):
      pclk = hal_rcc_get_pclk1();
      break;
    default:
      pclk = hal_rcc_get_pclk2();
      break;
  }

  // Target speed is 1-2 MHz, so we divide by 2 MHz to get a divisor
  uint32_t divisor = pclk / 2000000;

  // Round divisor up to the nearest power of 2 to guarantee a value between 1 and 2 MHz
  uint32_t br_bits;
  if (divisor > 128) {
    br_bits = SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0;
  }
  else if (divisor > 64) {
    br_bits = SPI_CR1_BR_2 | SPI_CR1_BR_1;
  }
  else if (divisor > 32) {
    br_bits = SPI_CR1_BR_2 | SPI_CR1_BR_0;
  }
  else if (divisor > 16) {
    br_bits = SPI_CR1_BR_2;
  }
  else if (divisor > 8) {
    br_bits = SPI_CR1_BR_1 | SPI_CR1_BR_0;
  }
  else if (divisor > 4) {
    br_bits = SPI_CR1_BR_1;
  }
  else if (divisor > 2) {
    br_bits = SPI_CR1_BR_0;
  }
  else {
    br_bits = 0x0;
  }

  cfg->reg->CR1 |= br_bits;
}

static inline void hal_spi_common_isr(spi_channel_t channel) {
  hal_spi_config_s *cfg = &spi_pin_map[SPI_CHANNEL_IDX(channel)];

  hal_rx_buffer_put(&cfg->rx_buf, cfg->reg->DR);
}


void SPI1_IRQHandler(void) {
  hal_spi_common_isr(SPI(1));
}

void SPI2_IRQHandler(void) {
  hal_spi_common_isr(SPI(2));
}
